# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'
tap 'd12frosted/emacs-plus'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some macOS tools
brew 'homebrew/dupes/grep'
brew 'homebrew/dupes/openssh'

# Install Binaries
brew 'git'
brew 'wget'

# Spacemacs/Emacs
brew 'emacs-plus', args: ['HEAD', 'with-natural-title-bars']

# Vim
brew 'vim'

# command-line fuzzy finder
brew 'fzf'

# node version manger
brew 'n'

# Tracks your most used directories and you can easily jump around
brew 'z'

# Clojure
cask 'java'
brew 'leiningen'
brew 'boot-clj'

# Apps
cask 'alfred'
cask 'caffeine'
cask 'firefox'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'google-drive'
cask 'gpgtools'
cask 'iterm2'
cask 'hyper'
cask 'atom-beta'
cask 'slack'
cask 'sketch'
cask 'spotify'

# Fonts
cask 'font-fira-code'
cask 'font-source-code-pro'
